Создаём папки со своими именами, в них папки с названиями предметов, и внутри предметов папки с названием лаб

Т. к. данные лабы, зачастую, нужно будет часто скачивать заново, чтобы не оставалось тяжёлых файлов на гитхабе(как например аудио файлы из лаб по ляхе), все такие файлы закидываем  в папку heavy/, она не гитхаб закидываться не будет

Все коммиты помечайте, чтобы можно было без проблем откатиться назад и не тыкать в каждый коммит и смотреть, что внутри, например, если добавил лабу 3 по защите, то коммит будет выглядеть след образом git commit -m 'add lab3 protect'

Также, если IDE создаёт лишний, ненужный мусор, например IntelijIDEA создаёт .idea, а вижуалка и вовсе левые папки по пол гига, то добавьте такие папки в .gitignore, в нём же есть образец, я другие директории блочил
